<script setup>
import HeaderButton from "@/UI/Buttons/HeaderButton/HeaderButton.vue";
import { ref } from "vue";
import PlusIcon from "@/components/icons/PlusIcon.vue";
import "./faq.scss";
const faqs = [
  {
    question: "Как проходит обучение на онлайн-курсах?",
    answer:
      "Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.",
  },
  {
    question: "Я покупаю пакет уроков или онлайн-курс, сколько он действует?",
    answer:
      "Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.",
  },
  {
    question: "Как быстро я достигну результатов?",
    answer:
      "Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.",
  },
  {
    question: "Когда я могу начать обучение?",
    answer:
      "Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.",
  },
  {
    question: "Как проходит обучение на индивидуальных занятиях?",
    answer:
      "Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.",
  },
];

const activeIndex = ref(null);

const toggle = (index) => {
  activeIndex.value = activeIndex.value === index ? null : index;
};
</script>

<template>
  <section class="faq">
    <div class="container">
      <div class="faq-block">
        <div>
          <div class="faq-title">Отвечаем на частые вопросы</div>

          <HeaderButton :text="'Задать вопрос'" />
        </div>
        <img
          src="@/assets/images/main/faq-img.png"
          alt="Iamge"
          loading="lazy"
        />
      </div>
      <div class="faq-items">
        <div
          class="faq-item"
          v-for="(item, index) in faqs"
          :key="index"
          :class="{ active: activeIndex === index }"
        >
          <div class="faq-question">
            {{ item.question }}
            <PlusIcon
              :size="30"
              class="faq-btn"
              @click="toggle(index)"
              :class="{ active: activeIndex === index }"
            />
          </div>

          <transition name="faq">
            <div class="faq-answer" v-if="activeIndex === index">
              {{ item.answer }}
            </div>
          </transition>
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped lang="scss"></style>
